#include <iostream>

#include<clocale>
using namespace std;

int main()


{
	setlocale(LC_ALL, "Russian");
		setlocale(0, "");
		int a, b, c, d, f, g, v, c1, ty, j, k, w1, v1, c2, e, w, o, tr, tru, typ,l1;
		
		cout << "Укажите ваш ТУ" << endl;
		cin >> ty;
			cout << "Укажите вес мехи(в фунтах)";
		cin >> a;
		cout << "Сколько установленно" << endl;
		cout << "Рук" << endl;
		cin >> b;
		cout << "Установлены руки-манипуляторы или нет?" << endl;
		cout << "1:Да" << endl;
		cout << "2:Нет" << endl;
		cin >> d;
		cout << "Ног" << endl;
		cin >> c;
		cout << "Сколько турелей?"<< endl;
		cin >> o;
		cout << "Есть ли внешние контейнеры?" << endl;
		cout << "1:Да" << endl;
		cout << "2:Нет" << endl;
		cin >> f;
		cout << "Сколько энергии тратится на движение ног?(в киловаттах)";
		cin >> g;
		if (g < 6) {
			if (ty = 8) { w = 60 * g; };
		if (ty = 9) { w = 40 * g; };
		if (ty = 10) { w = 30 * g; };
		if (ty = 11) { w = 20 * g; };
		if (ty > 11) { w = 15 * g; };
		};
		if(g>5){
			if (ty = 8) { w = (6 * g)+270; };
			if (ty = 9) { w = (4 * g)+180; };
			if (ty = 10) { w = (3 * g)+135; };
			if (ty = 11) { w = (2 * g)+90; };
			if (ty > 11) { w = (1 * g)+70; };
		};
		v = w / 50*(c);
	 if (c == 2) { c1 = w * 200; };
	 if (c == 3) { c1 = w * 100; };
	 if (c > 3) { c1 = w * 50; };
	 e = g;
	 cout << "Промежуточные результаты" << endl;
	 cout << "Вес=" << w << endl;
	 cout << "Объем=" << v << endl;
	 cout << "Цена=" << c1 << endl;
	
	 cout << "Энергия=" << e << endl;
	 cout << "Укажите силу рук";
	 cin >> j;
	 cout << "Укажите дополнительные опции" << endl;
	 cout << "1:Дешевые" << endl;
	 cout << "2:Гибкие" << endl;
	 cout << "3:Кулак-ракета" << endl;
	 cout << "4:Ничего" << endl;
	 cin >> k;
	if(k==1){
		if (ty = 8) { w1 = 0.2*j*2; };
		if (ty = 9) { w1 = 0.15*j*2; };
		if (ty = 10) { w1 = 0.1*j * 2; };
		if (ty = 11) { w1 = 0.075*j * 2; };
		if (ty > 11) { w1 =0.05 *j * 2; };
	};
	if(k==2){
		if (ty = 8) { w1 = 0.2*j * 2; };
		if (ty = 9) { w1 = 0.15*j * 2; };
		if (ty = 10) { w1 = 0.1*j * 2; };
		if (ty = 11) { w1 = 0.075*j * 2; };
		if (ty > 11) { w1 = 0.05 *j * 2; };
	};
	if(k==3){
		if (ty = 8) { w1 = 0.2*j * 1.5; };
		if (ty = 9) { w1 = 0.15*j * 1.5; };
		if (ty = 10) { w1 = 0.1*j * 1.5; };
		if (ty = 11) { w1 = 0.075*j * 1.5; };
		if (ty > 11) { w1 = 0.05 *j * 1.5; };
	};
	if(k==4){
		if (ty = 8) { w1 = 0.2*j; };
		if (ty = 9) { w1 = 0.15*j; };
		if (ty = 10) { w1 = 0.1*j; };
		if (ty = 11) { w1 = 0.075*j; };
		if (ty > 11) { w1 = 0.05 *j; };
	};




	if (k == 1) {
		if (ty = 8) { v1 = 0.004*j * 2; };
		if (ty = 9) { v1 = 0.003*j * 2; };
		if (ty = 10) { v1 = 0.002*j * 2; };
		if (ty = 11) { v1 = 0.0015*j * 2; };
		if (ty > 11) { v1 = 0.001 *j * 2; };
	};
	if (k == 2) {
		if (ty = 8) { v1 = 0.004*j * 2; };
		if (ty = 9) { v1 = 0.003*j * 2; };
		if (ty = 10) { v1 = 0.002*j * 2; };
		if (ty = 11) { v1 = 0.0015*j * 2; };
		if (ty > 11) { v1 = 0.001 *j * 2; };
	};
	if (k == 3) {
		if (ty = 8) { v1 = 0.004*j * 1.5; };
		if (ty = 9) { v1 = 0.003*j * 1.5; };
		if (ty = 10) { v1 = 0.002*j * 1.5; };
		if (ty = 11) { v1 = 0.0015*j * 1.5; };
		if (ty > 11) { v1 = 0.001 *j * 1.5; };
	};
	if(k==4) {
		if (ty = 8) { v1 = 0.004*j; };
		if (ty = 9) { v1 = 0.003*j; };
		if (ty = 10) { v1 = 0.002*j; };
		if (ty = 11) { v1 = 0.0015*j; };
		if (ty > 11) { v1 = 0.001 *j; };
	};


	if (k == 1) {
		if (ty = 8) { c2 = 400 *j*0.5; };
		if (ty = 9) { c2 = 300 * j*0.5; };
		if (ty = 10) { c2 = 200 * j*0.5; };
		if (ty = 11) { c2 = 150 * j*0.5; };
		if (ty > 11) { c2 = 100 * j*0.5; };
	};
	if (k == 2) {
		if (ty = 8) { c2 = 400 * j*2; };
		if (ty = 9) { c2 = 300 * j*2; };
		if (ty = 10) { c2 = 200 * j*2; };
		if (ty = 11) { c2 = 150 * j*2; };
		if (ty > 11) { c2 = 100 * j*2; };
	};
	if (k == 3) {
		if(ty = 8) { c2 = 400 * j*2; };
		if (ty = 9) { c2 = 300 * j*2; };
		if (ty = 10) { c2 = 200 * j*2; };
		if (ty = 11) { c2 = 150 * j*2; };
		if (ty > 11) { c2 = 100 * j*2; };
	};
	if(k==4){
		if (ty = 8) { c2 = 400 * j; };
		if (ty = 9) { c2 = 300 * j; };
		if (ty = 10) { c2 = 200 * j; };
		if (ty = 11) { c2 = 150 * j; };
		if (ty > 11) { c2 = 100 * j; };
	};

	double w2 = w1 + w,
	 v2 = v1 + v,
	 c3 = c2 + c1,
	 e1 = j / 200,
	 e2 = e1 + e;
	cout << "Промежуточные результаты" << endl;
	cout << "Вес=" << w2 << endl;
	cout << "Объем общий=" << v2 << endl;
	cout << "Объем рук=" << v1 << endl;
	cout << "Объем ног=" << v << endl;
	cout << "Цена=" << c3 << endl;
	cout << "Энергия=" << e2 << endl;
	cout << "Нужны дополнительные двигатели?" << endl;
	cout << "1:Да" << endl;
	cout << "2:Нет" << endl;
	cin >> tr;
	if (tr == 1) { 
		cout << "Укажите тягу" << endl;
		cin >> tru;
		cout << "Выберите тип двигателей" << endl;
	if (ty == 8) { cout << "1:Реактивный" << endl;
	cout << "2:Турбовинтовой" << endl;
	cout << "3:Твердотопливная ракета" << endl;
	cin >> typ;
	};
	if(ty==9){
		cout << "1:Реактивный" << endl;
		cout << "2:Турбовинтовой" << endl;
		cout << "3:Твердотопливная ракета" << endl;
		cout << "4:Супер-турбовинтовой" << endl;
		cout << "5:Термоядерная ракета" << endl;
		cout << "6:Воздушная термоядерная ракета" << endl;
		cout << "7:Ракеты без рабочего тела" << endl;
		cin >> typ;
	};
	if (ty==10){
		cout << "1:Реактивный" << endl;
		cout << "2:Турбовинтовой" << endl;
		cout << "3:Твердотопливная ракета" << endl;
		cout << "4:Супер-турбовинтовой" << endl;
		cout << "5:Термоядерная ракета" << endl;
		cout << "6:Воздушная термоядерная ракета" << endl;
		cout << "7:Ракеты без рабочего тела" << endl;
		cout << "8:Термоядерная ракета (улучшенная)" << endl;
		cout << "9:Воздушная термоядерная ракета(улучшенная) " << endl;
		cout << "10:Ракеты без рабочего тела(улучшенная)" << endl;
		cout << "11:Супер-ракеты без рабочего тела" << endl;
		cout << "12:Комбинация термоядерной и воздушной термоядерной ракеты" << endl;
		cin >> typ;
	};
	if(ty==11){
		cout << "1:Реактивный" << endl;
		cout << "2:Турбовинтовой" << endl;
		cout << "3:Твердотопливная ракета" << endl;
		cout << "4:Супер-турбовинтовой" << endl;
		cout << "5:Термоядерная ракета" << endl;
		cout << "6:Воздушная термоядерная ракета" << endl;
		cout << "7:Ракеты без рабочего тела" << endl;
		cout << "8:Термоядерная ракета (улучшенная)" << endl;
		cout << "9:Воздушная термоядерная ракета(улучшенная) " << endl;
		cout << "10:Ракеты без рабочего тела(улучшенная)" << endl;
		cout << "11:Супер-ракеты без рабочего тела" << endl;
		cout << "12:Комбинация термоядерной и воздушной термоядерной ракеты" << endl;
		cout << "13:Ракеты без рабочего тела(улучшенная)" << endl;
		cout << "14:Супер-ракеты без рабочего тела(улучшенные)" << endl;
		cin >> typ;
	};
	if(ty>13){
		cout << "1:Реактивный" << endl;
		cout << "2:Турбовинтовой" << endl;
		cout << "3:Твердотопливная ракета" << endl;
		cout << "4:Супер-турбовинтовой" << endl;
		cout << "5:Термоядерная ракета" << endl;
		cout << "6:Воздушная термоядерная ракета" << endl;
		cout << "7:Ракеты без рабочего тела" << endl;
		cout << "8:Термоядерная ракета (улучшенная)" << endl;
		cout << "9:Воздушная термоядерная ракета(улучшенная) " << endl;
		cout << "10:Ракеты без рабочего тела(улучшенная)" << endl;
		cout << "11:Супер-ракеты без рабочего тела" << endl;
		cout << "12:Комбинация термоядерной и воздушной термоядерной ракеты" << endl;
		cout << "13:Ракеты без рабочего тела(улучшенная)" << endl;
		cout << "14:Супер-ракеты без рабочего тела(улучшенные)" << endl;
		cout << "15:Мега ракеты без рабочего тела" << endl;
		cin >> typ;
	};
	double w3,c4,v3,f1;
	if (typ == 1) { w3 = (0.15*tru) + 150; 
	v3 = w3 / 50;
	f1 = 0.015*tru;
	c4 = 50 * tru;
	};
	if (typ == 2) { w3 = (0.15*tru) + 6.75;
	v3 = w3 / 100;
	c4 = 40 * tru;
	};
	if (typ == 3) { w3 = 0.015*tru;
	v3 = w3 / 50;
	f1 = 1.1*tru;
	c4 = 25 * tru;
	};
	if (typ == 4) { w3 = (0.12*tru) + 5;
	v3 = w3 / 50;
	f1 = 0.03*tru;
	c4 = 50 * tru;
	};
	if (typ == 5) { w3 = (0.075*tru) + 75;
	v3 = w3 / 50;
	f1 = 0.02*tru;
	c4 = 100 * tru;
	};
	if (typ == 6) { w3 = (0.15*tru) + 150;
	v3 = w3 / 50;
	c4 = 100 * tru;
	};
	if (typ == 7) { w3 = 1.5*tru;
	v3 = w3 / 50;
	c4 = tru * 25;
	};
	if (typ == 8) { w3 = (0.0375*tru) + 37.5;
	v3 = w3 / 50;
	f1 = 0.02*tru;
	c4 = 100 * tru;
	};
	if (typ == 9) { w3 = (0.075*tru) + 75;
	v3 = w3 / 50;
	c4 = 100 * tru;
	};
	if (typ == 10) { w3=0.75*tru;
	v3 = w3 / 50;
	c4 = tru * 20;
	};
	if (typ == 11) { w3 = 0.3*tru;
	v3 = w3 / 50;
	c4 = 100 * tru;
	};
	if (typ == 12) { w3 = (0.09*tru) + 90;
	v3 = w3 / 50;
	c4 = 200 * tru;
	};
	if (typ == 13) { w3 = 0.075*tru;
	v3 = w3 / 50;
	c4 = 20 * tru;
	};
	if (typ == 14) { w3 = 0.03*tru;
	v3 = w3 / 50;
	c4 = 100 * tru;
	};
	if (typ == 15) { w3 = 0.0015*tru;
	v3 = w3 / 50;
	c4 = 4000 * tru;
	};
	cout << "Укажите куда устанавливается" << endl;
	cout << "1:Руки" << endl;
	cout << "2:Тело" << endl;
	cout << "3:Ноги" << endl;
	cin >> l1;
	int w4 = w3 + w2;
int c5=c4+c3,b1;


	if(l1==1){
		int v5 = v3 + v1;
		int v4 = v5+v2;
		
		
		cout << "Промежуточные результаты" << endl;
		cout << "Вес=" << w4 << endl;
		cout << "Объем общий=" << v4 << endl;
		
		cout << "Объем рук=" << v5 << endl;
		cout << "Объем ног=" << v << endl;
		cout << "Цена=" << c5 << endl;
		cout << "Энергия=" << e2 << endl;
	};
if (l1 == 2) {
	int b1 =v3;
	int v4 = v3 + v2 + b1;
		cout << "Промежуточные результаты" << endl;
		cout << "Вес=" << w4 << endl;
		cout << "Объем общий=" << v4 << endl;
		cout << "Объем тела=" << b1 << endl;
		cout << "Объем рук=" << v1 << endl;
		cout << "Объем ног=" << v << endl;
		cout << "Цена=" << c5 << endl;
		cout << "Энергия=" << e2 << endl;
};
if (l1 == 3) {
	int v6 = v + v3;
	int v4 = v2 + v6;
	cout << "Промежуточные результаты" << endl;
	cout << "Вес=" << w4 << endl;
	cout << "Объем общий=" << v4 << endl;
	cout << "Объем рук=" << v1 << endl;
	cout << "Объем ног=" << v6 << endl;
	cout << "Цена=" << c5 << endl;
	cout << "Энергия=" << e2 << endl;
};
	};

	system("pause");
		return 0;


}
	